mysql_ssl_sysbench/result/mysql-ssl-test-ssl-off-threads2.result
sysbench 0.5:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 2
Report intermediate results every 10 second(s)
Random number generator seed is 0 and will be ignored


Threads started!

[  10s] threads: 2, tps: 9.10, reads: 130.23, writes: 37.21, response time: 403.00ms (95%), errors: 0.00, reconnects:  0.00
[  20s] threads: 2, tps: 9.80, reads: 137.20, writes: 39.20, response time: 352.21ms (95%), errors: 0.00, reconnects:  0.00
[  30s] threads: 2, tps: 10.10, reads: 141.40, writes: 40.40, response time: 319.56ms (95%), errors: 0.00, reconnects:  0.00
[  40s] threads: 2, tps: 9.40, reads: 131.60, writes: 37.60, response time: 356.35ms (95%), errors: 0.00, reconnects:  0.00
[  50s] threads: 2, tps: 9.00, reads: 126.00, writes: 36.00, response time: 363.89ms (95%), errors: 0.00, reconnects:  0.00
[  60s] threads: 2, tps: 9.40, reads: 131.60, writes: 37.60, response time: 352.74ms (95%), errors: 0.00, reconnects:  0.00
[  70s] threads: 2, tps: 10.30, reads: 144.20, writes: 41.20, response time: 275.55ms (95%), errors: 0.00, reconnects:  0.00
[  80s] threads: 2, tps: 9.90, reads: 138.60, writes: 39.60, response time: 350.95ms (95%), errors: 0.00, reconnects:  0.00
[  90s] threads: 2, tps: 9.20, reads: 127.40, writes: 36.40, response time: 363.24ms (95%), errors: 0.00, reconnects:  0.00
[ 100s] threads: 2, tps: 9.50, reads: 134.40, writes: 38.40, response time: 374.39ms (95%), errors: 0.00, reconnects:  0.00
[ 110s] threads: 2, tps: 10.30, reads: 144.20, writes: 41.20, response time: 285.89ms (95%), errors: 0.00, reconnects:  0.00
[ 120s] threads: 2, tps: 10.00, reads: 140.00, writes: 40.00, response time: 292.90ms (95%), errors: 0.00, reconnects:  0.00
[ 130s] threads: 2, tps: 10.00, reads: 140.00, writes: 40.00, response time: 352.00ms (95%), errors: 0.00, reconnects:  0.00
[ 140s] threads: 2, tps: 9.10, reads: 127.40, writes: 36.40, response time: 352.11ms (95%), errors: 0.00, reconnects:  0.00
[ 150s] threads: 2, tps: 9.40, reads: 131.60, writes: 37.60, response time: 370.93ms (95%), errors: 0.00, reconnects:  0.00
[ 160s] threads: 2, tps: 9.60, reads: 134.40, writes: 38.40, response time: 311.44ms (95%), errors: 0.00, reconnects:  0.00
[ 170s] threads: 2, tps: 10.50, reads: 147.00, writes: 42.00, response time: 264.09ms (95%), errors: 0.00, reconnects:  0.00
[ 180s] threads: 2, tps: 9.40, reads: 131.60, writes: 37.60, response time: 324.87ms (95%), errors: 0.00, reconnects:  0.00
[ 190s] threads: 2, tps: 9.10, reads: 127.40, writes: 36.40, response time: 383.47ms (95%), errors: 0.00, reconnects:  0.00
[ 200s] threads: 2, tps: 9.10, reads: 127.40, writes: 36.40, response time: 374.28ms (95%), errors: 0.00, reconnects:  0.00
[ 210s] threads: 2, tps: 9.60, reads: 134.40, writes: 38.40, response time: 319.94ms (95%), errors: 0.00, reconnects:  0.00
[ 220s] threads: 2, tps: 10.20, reads: 142.80, writes: 40.80, response time: 325.55ms (95%), errors: 0.00, reconnects:  0.00
[ 230s] threads: 2, tps: 9.50, reads: 133.00, writes: 38.00, response time: 341.21ms (95%), errors: 0.00, reconnects:  0.00
[ 240s] threads: 2, tps: 9.40, reads: 131.60, writes: 37.60, response time: 318.89ms (95%), errors: 0.00, reconnects:  0.00
[ 250s] threads: 2, tps: 9.80, reads: 137.10, writes: 38.80, response time: 354.12ms (95%), errors: 0.00, reconnects:  0.00
[ 260s] threads: 2, tps: 9.80, reads: 137.30, writes: 39.60, response time: 329.96ms (95%), errors: 0.00, reconnects:  0.00
[ 270s] threads: 2, tps: 10.80, reads: 151.20, writes: 43.20, response time: 251.74ms (95%), errors: 0.00, reconnects:  0.00
[ 280s] threads: 2, tps: 9.30, reads: 130.20, writes: 37.20, response time: 363.13ms (95%), errors: 0.00, reconnects:  0.00
[ 290s] threads: 2, tps: 9.50, reads: 133.00, writes: 38.00, response time: 308.01ms (95%), errors: 0.00, reconnects:  0.00
[ 300s] threads: 2, tps: 10.40, reads: 145.60, writes: 41.60, response time: 289.24ms (95%), errors: 0.00, reconnects:  0.00
[ 310s] threads: 2, tps: 10.00, reads: 140.00, writes: 40.00, response time: 308.47ms (95%), errors: 0.00, reconnects:  0.00
[ 320s] threads: 2, tps: 8.90, reads: 124.60, writes: 35.60, response time: 364.00ms (95%), errors: 0.00, reconnects:  0.00
[ 330s] threads: 2, tps: 9.60, reads: 134.40, writes: 38.40, response time: 351.90ms (95%), errors: 0.00, reconnects:  0.00
[ 340s] threads: 2, tps: 9.90, reads: 138.60, writes: 39.60, response time: 332.14ms (95%), errors: 0.00, reconnects:  0.00
[ 350s] threads: 2, tps: 10.30, reads: 144.20, writes: 41.20, response time: 252.26ms (95%), errors: 0.00, reconnects:  0.00
[ 360s] threads: 2, tps: 9.50, reads: 133.00, writes: 38.00, response time: 418.37ms (95%), errors: 0.00, reconnects:  0.00
[ 370s] threads: 2, tps: 9.70, reads: 135.80, writes: 38.80, response time: 347.81ms (95%), errors: 0.00, reconnects:  0.00
[ 380s] threads: 2, tps: 9.50, reads: 132.60, writes: 37.60, response time: 330.16ms (95%), errors: 0.00, reconnects:  0.00
[ 390s] threads: 2, tps: 9.10, reads: 126.80, writes: 36.40, response time: 352.21ms (95%), errors: 0.00, reconnects:  0.00
[ 400s] threads: 2, tps: 10.20, reads: 143.80, writes: 41.20, response time: 275.64ms (95%), errors: 0.00, reconnects:  0.00
[ 410s] threads: 2, tps: 9.80, reads: 137.20, writes: 39.20, response time: 367.73ms (95%), errors: 0.00, reconnects:  0.00
[ 420s] threads: 2, tps: 10.20, reads: 142.80, writes: 40.40, response time: 286.14ms (95%), errors: 0.00, reconnects:  0.00
[ 430s] threads: 2, tps: 9.70, reads: 135.80, writes: 39.20, response time: 360.10ms (95%), errors: 0.00, reconnects:  0.00
[ 440s] threads: 2, tps: 9.90, reads: 138.60, writes: 39.40, response time: 308.01ms (95%), errors: 0.00, reconnects:  0.00
[ 450s] threads: 2, tps: 10.10, reads: 140.70, writes: 40.20, response time: 286.32ms (95%), errors: 0.00, reconnects:  0.00
[ 460s] threads: 2, tps: 9.90, reads: 139.30, writes: 40.00, response time: 359.35ms (95%), errors: 0.00, reconnects:  0.00
[ 470s] threads: 2, tps: 9.60, reads: 134.30, writes: 38.00, response time: 352.64ms (95%), errors: 0.00, reconnects:  0.00
[ 480s] threads: 2, tps: 9.30, reads: 130.30, writes: 37.60, response time: 363.02ms (95%), errors: 0.00, reconnects:  0.00
[ 490s] threads: 2, tps: 10.30, reads: 144.20, writes: 41.20, response time: 230.74ms (95%), errors: 0.00, reconnects:  0.00
[ 500s] threads: 2, tps: 9.50, reads: 131.80, writes: 37.60, response time: 352.11ms (95%), errors: 0.00, reconnects:  0.00
[ 510s] threads: 2, tps: 9.30, reads: 131.40, writes: 37.60, response time: 352.21ms (95%), errors: 0.00, reconnects:  0.00
[ 520s] threads: 2, tps: 9.40, reads: 131.60, writes: 37.60, response time: 385.88ms (95%), errors: 0.00, reconnects:  0.00
[ 530s] threads: 2, tps: 9.40, reads: 131.60, writes: 37.60, response time: 361.61ms (95%), errors: 0.00, reconnects:  0.00
[ 540s] threads: 2, tps: 10.90, reads: 152.60, writes: 43.60, response time: 237.60ms (95%), errors: 0.00, reconnects:  0.00
[ 550s] threads: 2, tps: 9.50, reads: 133.00, writes: 38.00, response time: 291.33ms (95%), errors: 0.00, reconnects:  0.00
[ 560s] threads: 2, tps: 9.30, reads: 129.90, writes: 36.80, response time: 363.24ms (95%), errors: 0.00, reconnects:  0.00
[ 570s] threads: 2, tps: 9.70, reads: 136.10, writes: 39.20, response time: 353.06ms (95%), errors: 0.00, reconnects:  0.00
[ 580s] threads: 2, tps: 10.70, reads: 149.80, writes: 42.80, response time: 244.02ms (95%), errors: 0.00, reconnects:  0.00
[ 590s] threads: 2, tps: 9.40, reads: 131.60, writes: 37.60, response time: 348.54ms (95%), errors: 0.00, reconnects:  0.00
[ 600s] threads: 2, tps: 8.90, reads: 124.60, writes: 35.60, response time: 423.79ms (95%), errors: 0.00, reconnects:  0.00
OLTP test statistics:
    queries performed:
        read:                            81508
        write:                           23288
        other:                           11644
        total:                           116440
    transactions:                        5822   (9.70 per sec.)
    read/write requests:                 104796 (174.61 per sec.)
    other operations:                    11644  (19.40 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          600.1637s
    total number of events:              5822
    total time taken by event execution: 1200.1025s
    response time:
         min:                                 99.03ms
         avg:                                206.13ms
         max:                                955.70ms
         approx.  95 percentile:             352.00ms

Threads fairness:
    events (avg/stddev):           2911.0000/3.00
    execution time (avg/stddev):   600.0512/0.05